---
type: Mullion
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# Mullion

`Autodesk.Revit.DB.Mullion` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | BreakMullion | — | `public void BreakMullion ()` |
| Method | JoinMullion | — | `public void JoinMullion ()` |
| Property | FromRoom | — | `` |
| Property | LocationCurve | — | `public Curve LocationCurve { get ; }` |
| Property | Lock | — | `public bool Lock { get ; set ; }` |
| Property | Lockable | — | `public bool Lockable { get ; }` |
| Property | MullionType | — | `public MullionType MullionType { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Room | — | `` |
| Property | Space | — | `` |
| Property | ToRoom | — | `` |